In this exercise, you will have to analyze a dataset about some employees of a company
(salary.csv). The data includes information about (i) years of experience of the employee, (ii) the age of
the employee, and (iii) the salary of the employee. You need to write the code to answer the following
questions to transform and understand the data further.

There are some missing values in the data. In the experience years column, replace all missing values
by 3, and in the age column replace all the missing values by the mean of the column.

In [14]:
# Import the dataset
salary = pd.read_csv('salary.csv')
salary

    experience_years   age  salary
0                1.1   NaN   39343
1                1.3  24.0   46205
2                1.5  28.7   37731
3                NaN  31.0   43525
4                2.2   NaN   39891
5                2.9  33.0   56642
6                3.0   NaN   60150
7                3.2  34.5   54445
8                NaN  28.3   64445
9                3.7  29.6   57189
10               3.9  28.9   63218
11               4.0  34.0   55794
12               4.0  29.5   56957
13               4.1  24.8   57081
14               4.5  35.0   61111
15               4.9  29.2   67938
16               NaN  26.0   66029
17               5.3   NaN   83088
18               5.9  28.0   81363
19               6.0  29.3   93940
20               6.8  33.2   91738
21               7.1  30.0   98273
22               NaN  31.4  101302
23               8.2  32.0  113812
24               8.7   NaN  109431
25               9.0  34.0  105582
26               NaN  35.0  116969
27               9.6  36.0  112635
28              10.3  37.0  122391
29              10.5  38.0  121872

In [15]:
# Check the types of variables in the dataset
# gender and edu are categorical values while others are numerics
salary.head()

   experience_years   age  salary
0               1.1   NaN   39343
1               1.3  24.0   46205
2               1.5  28.7   37731
3               NaN  31.0   43525
4               2.2   NaN   39891

In [16]:
salary.shape

(30, 3)

In [17]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   experience_years  25 non-null     float64
 1   age               25 non-null     float64
 2   salary            30 non-null     int64
dtypes: float64(2), int64(1)
memory usage: 848.0 bytes

In [18]:
salary.describe()

       experience_years        age         salary
count         25.000000  25.000000      30.000000
mean           5.268000  31.216000   76003.000000
std            2.841613   3.712892   27414.429785
min            1.100000  24.000000   37731.000000
25%            3.200000  28.900000   56720.750000
50%            4.500000  31.000000   65237.000000
75%            7.100000  34.000000  100544.750000
max           10.500000  38.000000  122391.000000

In [19]:
experience_data = pd.Series(salary['experience_years'])

experience_data

0      1.1
1      1.3
2      1.5
3      NaN
4      2.2
5      2.9
6      3.0
7      3.2
8      NaN
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     NaN
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     NaN
23     8.2
24     8.7
25     9.0
26     NaN
27     9.6
28    10.3
29    10.5
Name: experience_years, dtype: float64

In [20]:
experience_data.isnull()

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16     True
17    False
18    False
19    False
20    False
21    False
22     True
23    False
24    False
25    False
26     True
27    False
28    False
29    False
Name: experience_years, dtype: bool

In [21]:
# If we take the sum of the above expression, we get the number of missing values

experience_data.isnull().sum()

5

As we can see it is 5

In [22]:
experience_data.fillna(3)

0      1.1
1      1.3
2      1.5
3      3.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.0
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     3.0
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     3.0
23     8.2
24     8.7
25     9.0
26     3.0
27     9.6
28    10.3
29    10.5
Name: experience_years, dtype: float64

----in the age column replace all the missing values by the mean of the column

In [23]:
age_data = pd.Series(salary['age'])

age_data

0      NaN
1     24.0
2     28.7
3     31.0
4      NaN
5     33.0
6      NaN
7     34.5
8     28.3
9     29.6
10    28.9
11    34.0
12    29.5
13    24.8
14    35.0
15    29.2
16    26.0
17     NaN
18    28.0
19    29.3
20    33.2
21    30.0
22    31.4
23    32.0
24     NaN
25    34.0
26    35.0
27    36.0
28    37.0
29    38.0
Name: age, dtype: float64

In [24]:
age_data.fillna(age_data.mean())

0     31.216
1     24.000
2     28.700
3     31.000
4     31.216
5     33.000
6     31.216
7     34.500
8     28.300
9     29.600
10    28.900
11    34.000
12    29.500
13    24.800
14    35.000
15    29.200
16    26.000
17    31.216
18    28.000
19    29.300
20    33.200
21    30.000
22    31.400
23    32.000
24    31.216
25    34.000
26    35.000
27    36.000
28    37.000
29    38.000
Name: age, dtype: float64

In [25]:
salary['age'].fillna(int(salary['age'].mean()), inplace=True)
salary['experience_years'].fillna(3, inplace=True)

In [26]:
print(salary)

    experience_years   age  salary
0                1.1  31.0   39343
1                1.3  24.0   46205
2                1.5  28.7   37731
3                3.0  31.0   43525
4                2.2  31.0   39891
5                2.9  33.0   56642
6                3.0  31.0   60150
7                3.2  34.5   54445
8                3.0  28.3   64445
9                3.7  29.6   57189
10               3.9  28.9   63218
11               4.0  34.0   55794
12               4.0  29.5   56957
13               4.1  24.8   57081
14               4.5  35.0   61111
15               4.9  29.2   67938
16               3.0  26.0   66029
17               5.3  31.0   83088
18               5.9  28.0   81363
19               6.0  29.3   93940
20               6.8  33.2   91738
21               7.1  30.0   98273
22               3.0  31.4  101302
23               8.2  32.0  113812
24               8.7  31.0  109431
25               9.0  34.0  105582
26               3.0  35.0  116969
27               9.6  36.0  112635
28              10.3  37.0  122391
29              10.5  38.0  121872

Check the correlation between the columns of the data. Based on the results, check, does experience or age impact salary more?

   - Check the correlation between the columns of the data

In [27]:
salary.corr()

                  experience_years       age    salary
experience_years          1.000000  0.535703  0.834603
age                       0.535703  1.000000  0.523353
salary                    0.834603  0.523353  1.000000

In [28]:
#Calculate the correlation between Experience years	and Age
exp_age=salary['experience_years'].corr(salary['age'])
print('correlation between Experience years and Age is', exp_age)

correlation between Experience years and Age is 0.5357028471981783

In [29]:
#Calculate the correlation between Experience years	and Salary
exp_salary=salary['experience_years'].corr(salary['salary'])
print('correlation between Experience years and Salary is', exp_salary)

correlation between Experience years and Salary is 0.8346030993050744

In [30]:
#Calculate the correlation between Salary years	and Age
salary_age=salary['salary'].corr(salary['age'])
print('correlation between Salary and Age is', salary_age)

correlation between Salary and Age is 0.523352990905591

???Based on the results, what is your opinion, does experience or age impact salary more?

In [31]:
np.corrcoef(salary['experience_years'], salary['age'])

array([[1.        , 0.53570285],
       [0.53570285, 1.        ]])

 --->>>Correlation coefficients whose magnitude are between 0.7 and 0.9 indicate variables which can be considered highly correlated. Correlation coefficients whose magnitude are between 0.5 and 0.7 indicate variables which can be considered moderately correlated

In [32]:
from scipy.stats import linregress
linregress(salary['experience_years'], salary['age'])

LinregressResult(slope=0.6643869031301838, intercept=27.9311480436934, rvalue=0.5357028471981783, pvalue=0.002281606945714231, stderr=0.1979108925555436)

Since the p-value of 0.0022 is smaller than 0.05, we reject the null hypothesis that the relationship between the age and their work experience is not significant.

- Create a categorical version of the salary column with 3 groups: (i) values between 0 and 55000, (ii)
values between 55000 and 90000, (iii) values between 90000 and 125000. Label the groups [’Low’,
’Medium’, ’High’]. Calculate the average age of employees who have High salary.

In [33]:
Low=salary[(salary['salary']>0) & (salary['salary']<55000)]
Medium=salary[(salary['salary']>55000) & (salary['salary']<90000)]
High=salary[(salary['salary']>90000) & (salary['salary']<125000)]
print ('Group LOW', 
       Low)
print ('Group MEDIUM', 
       Medium)
print ('Group HIGH', 
       High)

Group LOW    experience_years   age  salary
0               1.1  31.0   39343
1               1.3  24.0   46205
2               1.5  28.7   37731
3               3.0  31.0   43525
4               2.2  31.0   39891
7               3.2  34.5   54445
Group MEDIUM     experience_years   age  salary
5                2.9  33.0   56642
6                3.0  31.0   60150
8                3.0  28.3   64445
9                3.7  29.6   57189
10               3.9  28.9   63218
11               4.0  34.0   55794
12               4.0  29.5   56957
13               4.1  24.8   57081
14               4.5  35.0   61111
15               4.9  29.2   67938
16               3.0  26.0   66029
17               5.3  31.0   83088
18               5.9  28.0   81363
Group HIGH     experience_years   age  salary
19               6.0  29.3   93940
20               6.8  33.2   91738
21               7.1  30.0   98273
22               3.0  31.4  101302
23               8.2  32.0  113812
24               8.7  31.0  109431
25               9.0  34.0  105582
26               3.0  35.0  116969
27               9.6  36.0  112635
28              10.3  37.0  122391
29              10.5  38.0  121872

- Calculate the average age of employees who have High salary

In [34]:
print('The average age of employees who have High salary:')
High["age"].mean()

The average age of employees who have High salary:

33.35454545454545